       01  FILLER                      REDEFINES WRK-CNEGOC-COBR.
           05  FILLER                  PIC 9(007).
           05  WRK-AGENC-CNEGOC        PIC 9(004).
           05  WRK-CONTA-CNEGOC        PIC 9(007).
