       05  CVCAW027-REGISTRO. 
        10  CVCAW027-NUM-LOTE            PIC 9(09).
        10  CVCAW027-SIST-LYOUT-ORIGE    PIC X(08).
        10  CVCAW027-OCORRENCIAS  OCCURS 3 TIMES  .                  
          15  CVCAW027-OCORR      
                    PIC X(08).
        10  CVCAW027-NSEQ-REG-LOTE       PIC 9(09).
        10  CVCAW027-NSEQ-REG-TOTAL      PIC 9(09).
        10  CVCAW027-CINDCD-ORIG-PGTO    PIC 9(01).
        10  CVCAW027-NUM-ARQUIVO         PIC 9(09)  VALUE 5 OCCURS 4 TO 10 TIMES DEPENDING ON WRK-CRRR.
        10  CVCAW027-CSIST-ORIG          PIC X(04)  VALUE 5 OCCURS 4 TO 10 TIMES DEPENDING ON WRK-CRRR.
        10  CVCAW027-NSEQ-PAGFOR         PIC 9(05).
        10  CVCAW027-VPAGTO              PIC 9(15)V9(02) COMP-3  VALUE 5 OCCURS 4 TO 10 TIMES DEPENDING ON WRK-CRRR.
        10  FILLER  PIC X(26).
        10  CVCAW027-IND-ERRO            PIC 9(01).
